anthropic.claude-code
charliermarsh.ruff
docker.docker
george-alisson.html-preview-vscode
github.copilot
github.copilot-chat
mechatroner.rainbow-csv
mhutchie.git-graph
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
esbenp.prettier-vscode
foxundermoon.shell-format
streetsidesoftware.code-spell-checker
timonwong.shellcheck
tamasfe.even-better-toml
yzhang.markdown-all-in-one
